<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of UPDD Commander.</string>
	<key>Identifier</key>
	<string>com.github.sd68tech.download.UPDDCommander</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>UPDD Commander</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<!-- <dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
				<key>url</key>
				<string>http://osx.skokie68.org/repo/Mac%20UPDD_06_00_616_for%20IFP50%20Gen2_Gen3_IFP70.dmg</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict> -->
		
		
		<!-- https://www.viewsonicglobal.com/public/products_download/software/ifp/ifp50/Mac_UPDD_06_00_616_for_IFP50 Gen2_Gen3_IFP70.zip -->
		
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>(Mac_UPDD_[\s\S]*?\.zip)</string>
				<key>result_output_varname</key>
				<string>match</string>
				<key>url</key>
				<string>https://www.viewsonic.com/in/products/viewboard/IFP7550-3</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		
		
		
		<dict>
		    <key>Arguments</key>
		    <dict>
			<key>find</key>
			<string> </string>
			<key>input_string</key>
			<string>%match%</string>
			<key>replace</key>
			<string>%20</string>
		    </dict>
		    <key>Processor</key>
		    <string>com.github.homebysix.FindAndReplace/FindAndReplace</string>
		</dict>		
		
		
		
		
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.zip</string>
				<key>url</key>
				<string>https://www.viewsonicglobal.com/public/products_download/software/ifp/ifp50/%output_string%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>	
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Unarchiver</string>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%pathname%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack-zip</string>
				<key>purge_destination</key>
				<true/>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>FileFinder</string>
			<key>Arguments</key>
			<dict>
				<key>pattern</key>
				<string>%RECIPE_CACHE_DIR%/unpack-zip/*.dmg</string>
			</dict>
		</dict>
		
		
		
		
		<dict>
			<key>Arguments</key>
			<dict>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Installer: Touch-Base Ltd (U86H28HG4S)</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
				<key>input_path</key>
				<string>%found_filename%/*.pkg</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack-pkg</string>
				<key>flat_pkg_path</key>
				<string>%found_filename%/*.pkg</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>FlatPkgUnpacker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/payload-pkg</string>
				<key>pkg_payload_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack-pkg/UPDD.pkg/Payload</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>PkgPayloadUnpacker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%RECIPE_CACHE_DIR%/payload-pkg/Library/Application Support/UPDD/UPDD Commander.app/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleShortVersionString</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
	</array>
</dict>
</plist>
